## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.avm-res-network-virtualnetwork.azapi_resource.vnet will be created
  + resource "azapi_resource" "vnet" {
      + body                      = {
          + extendedLocation = null
          + properties       = {
              + addressSpace         = {
                  + addressPrefixes = [
                      + "10.0.0.0/16",
                    ]
                }
              + bgpCommunities       = null
              + ddosProtectionPlan   = null
              + dhcpOptions          = null
              + enableDdosProtection = false
              + enableVmProtection   = false
              + encryption           = null
              + flowTimeoutInMinutes = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "North Europe"
      + name                      = "VNET-HUB"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions"
      + schema_validation_enabled = true
      + type                      = "Microsoft.Network/virtualNetworks@2023-11-01"
    }

  # module.avm-res-network-virtualnetwork.module.subnet["subnet1"].azapi_resource.subnet will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.0.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "snet-1"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2023-11-01"
    }

  # module.avm-res-network-virtualnetwork.module.subnet["subnet2"].azapi_resource.subnet will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.1.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "snet-2"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2023-11-01"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>